# AssetPropertyList Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
AssetPropertyList Properties
AssetPropertyList Class See Also
---
The AssetPropertyList type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsReadOnly | Identifies if the object is read-only or modifiable. If true, the object may not be modified. If false, the object's contents may be modified.  (Inherited from AssetProperty.) |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity.  (Inherited from AssetProperty.) |
| Name | Get the name of the AssetProperty (Inherited from AssetProperty.) |
| NumberOfConnectedProperties | The number of currently connected properties.  (Inherited from AssetProperty.) |
| Type | Returns the type of the AssetProperty (Inherited from AssetProperty.) |

# See Also
AssetPropertyList Class
Autodesk.Revit.DB.Visual Namespace